{
  "name": "Hi, I'm <span class='text-Glaucous'>Bence</span>",
  "description": "I'm a <span class='text-Glaucous'>{{age}}</span> years old <span class='text-Glaucous'>French business student</span>. I always loved to create things with computers. It's been more than <span class='text-Glaucous'>10 years</span> now that I'm building apps with <span class='text-Glaucous'>code</span>. I'm interested in all fields of computer science. I'm currently learning <span class='text-Glaucous'>Kubernetes</span> to better manage my own infrastrucure. I'm also a big fan of <span class='text-Glaucous'>Open Source Software</span>.",
  "buttonText": "EN",
  "Resume": "Resume",
  "Timeline": "Timeline",
  "Projects": "Projects",
  "MiNET": "MiNET is a student association that provides internet access to students living in the dorms of the Campus of Telecom Sudparis and Institut Mines-Telecom Business School. I was in charge of maintaining several critical softwares and cloud images for our hosting infrastructure. I was also in charge of assessing the training needs of the members and organizing trainings.",
  "IMTBS": "IMT-BS is a french business school that emphasizes on the use of new technologies in business. The school is part of the Institut Mines-Telecom, a french public institution that gathers 8 schools. I'm currently studying there to get a Master's degree in Information System for Market Finance.",
  "CPGE": "A CPGE is a french preparatory class for the competitive entrance exams to the french engineering and business schools. I studied there for 2 years in Mathematics and Economics. I was admitted to the Institut Mines-Telecom Business School after the competitive entrance exams.",
  "Status": "Status",
  "//Project 1": "Project 1",
  "Title project 1": "Portfolio Website",
  "Description project 1": "Learned React and improved my web development skills by building this website. This website is the one you are currently visiting. It is built with React and TailwindCSS. It will soon be hosted on a Kubernetes cluster on my own infrastructure. I'm also planning to add a blog to this website. To tell you more about my projects and about all the things I'm learning.",
  "Category project 1": "Web Development",
  "Status project 1": "In Progress",
  "//Project 2": "Project 2",
  "Title project 2": "ADH6 Webapp",
  "Description project 2": "Volunteering at MiNET I was in charge of maintaining the ADH6 webapp. This webapp is used by the members of the association to manage the network of the dorms. I improved the webapp by adding new features and fixing bugs. I also improved the deployment process by adding CI/CD. This webapp helped me improve in both frontend and backend development.",
  "Category project 2": "Full Stack Development",
  "Status project 2": "Completed",
  "//Project 3": "Project 3",
  "Title project 3": "Hosting",
  "Description project 3": "Worked the cloud infrastructure of MiNET. I was in charge of maintaining the cloud images. I learned how to use Packer to build cloud images, learned how to use Terraform to deploy infrastructure, learned how to use Ansible to configure cloud instances, learned how to use Docker to deploy applications and automate instance deployment with cloud-init images.",
  "Category project 3": "Cloud",
  "Status project 3": "Completed",
  "//Project 4": "Project 4",
  "Title project 4": "Learning Kubernetes",
  "Description project 4": "Learning Kubernetes to better manage my own infrastructure. I'm currently learning how to use Kubernetes to deploy applications and how to use Helm to deploy applications with a package manager. I'm using Terraform to deploy my Kubernetes cluster on my own infrastructure. I'm hosting my own load balancer with MetalLB. I'm also learning how to use Traefik as an ingress controller.",
  "Category project 4": "SysAdmin",
  "Status project 4": "Learning",
  "//Project 5": "Project 5",
  "Title project 5": "Homelab",
  "Description project 5": "I'm managing my own infrastructure at home. For now it's built with old computers but I plan on expanding to entreprise hardware. I'm using Proxmox to manage my virtual machines. I'm using Terraform to deploy my virtual machines. I'm using Ansible to provision my virtual machines. Some of my workloads are hosted using Docker and Docker Compose.",
  "Category project 5": "SysAdmin",
  "Status project 5": "In Progress",
  "//Project 6": "Project 6"
}
