{
  "name": "Salut, je m'appelle <span class='text-Glaucous'>Bence</span>",
  "description": "Je suis un <span class='text-Glaucous'>étudiant français en école de commerce</span> de <span class='text-Glaucous'>{{age}} ans</span>. J'ai toujours aimé créer des choses avec des ordinateurs. Cela fait maintenant plus de <span class='text-Glaucous'>10 ans</span> que je crée des applications avec du <span class='text-Glaucous'>code</span>. Je m'intéresse à tous les domaines de l'informatique. Actuellement je suis en train d'apprendre <span class='text-Glaucous'>Kubernetes</span> pour mieux gérer mon infrastrucure. Je suis également un grand fan du <span class='text-Glaucous'>mouvement du logiciel libre</span>.",
  "buttonText": "FR",
  "Resume": "CV",
  "Timeline": "Chronologie",
  "Projects": "Projets",
  "MiNET": "MiNET est une association étudiante qui fournit un accès internet aux étudiants vivant dans les dortoirs du Campus de Telecom Sudparis et de l'Institut Mines-Telecom Business School. J'étais en charge de la maintenance de plusieurs logiciels critiques et d'images cloud pour notre infrastructure d'hébergement. J'étais également chargé d'évaluer les besoins en formation des membres et d'organiser des formations.",
  "IMTBS": "IMT-BS est une école de commerce française qui met l'accent sur l'utilisation des nouvelles technologies dans l'entreprise. L'école fait partie de Institut Mines-Télécom, un groupement d'établissement public français regrouppant 8 écoles. J'y étudie actuellement pour obtenir un Master en Système d'Information pour la Finance de Marché.",
  "CPGE": "Une CPGE est une classe préparatoire aux concours d'entrée dans les écoles d'ingénieurs et de commerce françaises. J'ai étudié en CPGE HEC-E pendant deux ans. J'ai été admis à Institut Mines-Télécom Business School après les concours d'entrée.",
  "Status": "Statut",
  "//Project 1": "Project 1",
  "Title project 1": "Site de présentation",
  "Description project 1": "J'ai appris à utiliser React et amélioré mes compétences en développement web en construisant ce site web. Le site en question est celui que vous visitez actuellement. Il est construit avec React et TailwindCSS. Il sera bientôt hébergé sur un cluster Kubernetes sur ma propre infrastructure. Je prévois également d'ajouter un blog à ce site web. Pour vous en dire plus sur mes projets et sur toutes les choses que j'apprends.",
  "Category project 1": "Dév. Web",
  "Status project 1": "En cours",
  "//Project 2": "Project 2",
  "Title project 2": "ADH6",
  "Description project 2": "En tant que bénévole à MiNET, j'ai assuré la maintenance de la plateforme ADH6. Cette plateforme est utilisée par les membres de l'association pour gérer le réseau des dortoirs. J'ai amélioré l'application web en ajoutant de nouvelles fonctionnalités et en corrigeant des bugs. J'ai également amélioré le processus de déploiement en ajoutant du CI/CD. Cette application web m'a permis d'améliorer le développement du frontend et backend.",
  "Category project 2": "Dév. full stack",
  "Status project 2": "Terminé",
  "//Project 3": "Project 3",
  "Title project 3": "Hosting",
  "Description project 3": "J'ai travaillé sur l'infrastructure cloud de l'association MiNET. J'étais en charge de la maintenance des images cloud. J'ai appris à utiliser Packer pour construire des images cloud, à utiliser Terraform pour déployer l'infrastructure, à utiliser Ansible pour configurer les instances cloud, à utiliser Docker pour déployer des applications et automatiser le déploiement d'instances avec des images cloud-init.",
  "Category project 3": "Cloud",
  "Status project 3": "Terminé",
  "//Project 4": "Project 4",
  "Title project 4": "Apprendre Kubernetes",
  "Description project 4": "J'apprends Kubernetes pour mieux gérer ma propre infrastructure. J'apprends à utiliser Kubernetes pour déployer mes propres applications et à utiliser le gestionnaire de paquet Helm pour déployer des applications. J'utilise Terraform pour déployer mon cluster Kubernetes sur ma propre infrastructure. J'héberge mon propre load balancer avec MetalLB. J'apprends également à utiliser Traefik comme contrôleur ingress.",
  "Category project 4": "SysAdmin",
  "Status project 4": "En cours d'apprentissage",
  "//Project 5": "Project 5",
  "Title project 5": "Homelab",
  "Description project 5": "Je gère ma propre infrastructure à la maison. Pour l'instant, elle est construite avec de vieux ordinateurs, mais je prévois de l'étendre à du matériel d'entreprise. J'utilise Proxmox pour gérer mes machines virtuelles. J'utilise Terraform pour déployer mes machines virtuelles. J'utilise Ansible pour provisionner mes machines virtuelles. Certaines applications sont hébergées à l'aide de Docker et de Docker Compose.",
  "Category project 5": "SysAdmin",
  "Status project 5": "En cours",
  "//Project 6": "Project 6"
}
